<a href="https://colab.research.google.com/github/Shivani-781/Machine-Learning-and-its-Applications/blob/master/Pandas_Tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### Pandas is an Open Source Library built on top of NumPy
#### It allows for analysis and data cleaning and preparation 
#### It also has built-in visualization feature
#### It can work with data from a wide variety of sources

# Series in Pandas

In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [ ]:
labels=['a','b','c']
my_data=[10, 20, 30] 
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [ ]:
labels

['a', 'b', 'c']

In [ ]:
my_data

[10, 20, 30]

In [ ]:
arr

array([10, 20, 30])

In [ ]:
d

{'a': 10, 'b': 20, 'c': 30}

In [ ]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
d

{'a': 10, 'b': 20, 'c': 30}

In [ ]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [ ]:
pd.Series(data=[sum, print, len])    # can also hold built in functions

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [ ]:
ser1=pd.Series(data=[1,2,3,4],index=['USA', 'GERMANY', 'INDIA', 'JAPAN'])

In [ ]:
ser1

USA        1
GERMANY    2
INDIA      3
JAPAN      4
dtype: int64

In [ ]:
ser2=pd.Series([1,5,3,4],['USA','Sri Lanka', 'INDIA','JAPAN'])

In [ ]:
ser2

USA          1
Sri Lanka    5
INDIA        3
JAPAN        4
dtype: int64

In [ ]:
ser1['JAPAN']

4

In [ ]:
ser3=pd.Series(labels)

In [ ]:
ser3

0    a
1    b
2    c
dtype: object

In [ ]:
ser3[1]

'b'

In [ ]:
ser1+ser2

GERMANY      NaN
INDIA        6.0
JAPAN        8.0
Sri Lanka    NaN
USA          2.0
dtype: float64

## DataFrames

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
np.random.seed(101)

In [ ]:
from numpy.random import randn  # The numpy.random.randn() function creates an array of specified shape and fills it with random numbers

In [ ]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [ ]:
df     #DataFrame is the combination of Series sharing same index

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df['W']     #selecting one column

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [ ]:
type(df['W'])

pandas.core.series.Series

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
 df.W    # it is possible but don't use this because it may confuse with method called from object

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [ ]:
df[['W','Y']]   # selecting multiple Column

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905
C  0.807706  0.638787
D -0.497104 -0.943406
E -0.116773  0.238127

In [ ]:
df['newcol']=df['W']+df['X']

In [ ]:
df['newcol_2']=[3,4,5,6,7]

In [ ]:
df

          W         X         Y         Z    newcol  newcol_2
A  0.302665  1.693723 -1.706086 -1.159119  1.996388         3
B -0.134841  0.390528  0.166905  0.184502  0.255687         4
C  0.807706  0.072960  0.638787  0.329646  0.880666         5
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174         6
E -0.116773  1.901755  0.238127  1.996652  1.784981         7

In [ ]:
df.drop(['newcol_2','newcol'], axis=1, inplace=True)    # droping the column, axis=0 is for index by default, axis=1 for column

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df.drop('E')    #droping the row

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [ ]:
df.shape    #so here axis 0 is for row, 1 for column

(5, 4)

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df.loc['B']                                   # selecting rows by location (label)

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [ ]:
df.iloc[1]                 #selcting rows by index value

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [ ]:
df.iloc[2,1]                           #selecting subset of rows and columns

0.07295967531703869

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [ ]:
df.loc['A':'C','X':'Z']     # C and Z are inclusive

          X         Y         Z
A  1.693723 -1.706086 -1.159119
B  0.390528  0.166905  0.184502
C  0.072960  0.638787  0.329646

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

### Conditional Selection in Data Frame

In [ ]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [ ]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [ ]:
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [ ]:
df['Z']<0

A     True
B    False
C    False
D    False
E    False
Name: Z, dtype: bool

In [ ]:
df[df['Z']<0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [ ]:
resultdf= df[df['W']>0]    #creating subset of data frame

In [ ]:
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [ ]:
resultdf['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [ ]:
df[df['W']>0] ['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [ ]:
df[df['W']>0] ['X']     #creating subset of data frame in one line

A    1.693723
C    0.072960
Name: X, dtype: float64

In [ ]:
df[df['W']>0] [['X','Z']]   #selecting multiple line with above condition

          X         Z
A  1.693723 -1.159119
C  0.072960  0.329646

In [ ]:
boolser = df['W']>0    # breaking the aforementioned syntax in multiple lines
result = df[boolser]
col = ['X','Z']
result[col]

          X         Z
A  1.693723 -1.159119
C  0.072960  0.329646

In [ ]:
df[(df['W']>0) & (df['Y']>0)]             #Using multiple conditions, use &/| instead of and/or

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [ ]:
df[(df['W']>0) & (df['Y']>0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df.reset_index()            # reset index to default

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [ ]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [ ]:
newind='UP BR MP WB RJ'.split()

In [ ]:
newind

['UP', 'BR', 'MP', 'WB', 'RJ']

In [ ]:
df['states']=newind

In [ ]:
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119     UP
B -0.134841  0.390528  0.166905  0.184502     BR
C  0.807706  0.072960  0.638787  0.329646     MP
D -0.497104 -0.754070 -0.943406  0.484752     WB
E -0.116773  1.901755  0.238127  1.996652     RJ

In [ ]:
df.set_index('states')             # convert the column as your index, here we are not taking default index as in reset_index()

               W         X         Y         Z
states
UP      0.302665  1.693723 -1.706086 -1.159119
BR     -0.134841  0.390528  0.166905  0.184502
MP      0.807706  0.072960  0.638787  0.329646
WB     -0.497104 -0.754070 -0.943406  0.484752
RJ     -0.116773  1.901755  0.238127  1.996652

In [ ]:
df

          W         X         Y         Z states
A  0.302665  1.693723 -1.706086 -1.159119     UP
B -0.134841  0.390528  0.166905  0.184502     BR
C  0.807706  0.072960  0.638787  0.329646     MP
D -0.497104 -0.754070 -0.943406  0.484752     WB
E -0.116773  1.901755  0.238127  1.996652     RJ

### Groupby

In [ ]:
import pandas as pd

In [ ]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Kranti','Sobhan','Anima','Ashish','Sauvik','Kritika'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df=pd.DataFrame(data)

In [ ]:
df

  Company   Person  Sales
0    GOOG   Kranti    200
1    GOOG   Sobhan    120
2    MSFT    Anima    340
3    MSFT   Ashish    124
4      FB   Sauvik    243
5      FB  Kritika    350

** Now you can use the .groupby() method to group rows together based on a column name. For instance let's group based on Company. This will create a DataFrameGroupBy object:**

In [ ]:
df.groupby('Company')

You can save this object as a new variable:

In [ ]:
by_comp = df.groupby("Company")

And then call aggregate methods of the object:

In [ ]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [ ]:
by_comp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [ ]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [ ]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [ ]:
by_comp.min()

          Person  Sales
Company
FB       Kritika    243
GOOG      Kranti    120
MSFT       Anima    124

In [ ]:
by_comp.max()

         Person  Sales
Company
FB       Sauvik    350
GOOG     Sobhan    200
MSFT     Ashish    340

In [ ]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

### Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating.

In [ ]:
import pandas as pd

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Concatenation

Concatenation basically glues together DataFrames. Dimensions should match along the axis you are concatenating on.

In [ ]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11